//SUBPROG JOB 1,CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID
//COBRUN  EXEC IGYWCL
//COBOL.SYSIN  DD DSN=&SYSUID..CBL(SUBPROG),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(SUBPROG),DISP=SHR
// IF RC < 5 THEN
//RUN     EXEC PGM=SUBPROG
//STEPLIB   DD DSN=&SYSUID..LOAD,DISP=SHR
//IDXFILE   DD DSN=&SYSUID..VSAM.AA,DISP=SHR
//SYSOUT    DD SYSOUT=A
//CEEDUMP   DD DUMMY
//SYSUDUMP  DD DUMMY
// ELSE
// ENDIF
